In [1]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os

In [2]:
engine = create_engine('mysql+pymysql://root:kcmo1728@localhost/sakila')

If I needed total sales I could do a query like this:

In [3]:
sql_query = """
 select sum(amount) AS Gross
 from payment p
 join rental r
 on (p.rental_id = r.rental_id)
 join inventory i
 on (i.inventory_id = r.inventory_id)
"""
joined = pd.read_sql_query(sql_query, engine)
joined.head()

      Gross
0  67406.56

But what about total sales from each store? This one gets harder:

In [4]:
sql_query = """
 select s.store_id, sum(amount) AS Gross
 from payment p
 join rental r
 on (p.rental_id = r.rental_id)
 join inventory i
 on (i.inventory_id = r.inventory_id)
 join store s
 on (s.store_id = i.store_id)
 group by s.store_id;
"""
joined = pd.read_sql_query(sql_query, engine)
joined.head()

   store_id     Gross
0         1  33679.79
1         2  33726.77

## Creating Views

* It would be a pain to remember that query every time you want to get the total sales from each store. Wouldn't it be nice to save it somewhere?

* Well, with SQL you can do this. They are called **Views**

* First, because we need to create a view, instead of just querying our database we will need to use pymysql instead of sqlalchemy. I'll pull in the trusty RunSQL function and change the database to **sakila**.

In [5]:
def RunSQL(sql_command):
    connection = pymysql.connect(host='localhost',
                             user='root',
                             password='kcmo1728',
                             db='sakila',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)
    try:
        with connection.cursor() as cursor:
            commands = sql_command.split(';')
            for command in commands:
                if command == '\n': continue
                cursor.execute(command + ';')
                connection.commit()
    except Exception as e: 
        print(e)
    finally:
        connection.close()

In [6]:
sql_query = """
 create view total_sales as
 select s.store_id, sum(amount) AS Gross
 from payment p
 join rental r
 on (p.rental_id = r.rental_id)
 join inventory i
 on (i.inventory_id = r.inventory_id)
 join store s
 on (s.store_id = i.store_id)
 group by s.store_id;
"""
RunSQL(sql_query)

* Refresh your MySQL Workbench Schema and you should see the new view in your list:

![](images/views.png)

To call it now, all you have to do is use the following query:

In [7]:
total_sales = pd.read_sql_query('select * from total_sales', engine)
total_sales.head()

   store_id     Gross
0         1  33679.79
1         2  33726.77

To delete, you can right click on the view in MySQL Workbench and select 'drop view' or use the sql command:

In [8]:
RunSQL('drop view total_sales')